#ifndef _CONDITIONAL_H_
#define _CONDITIONAL_H_

//#############################################################################
//					“Об’єктно-орієнтоване програмування”					   
//												
//		Екзаменаційне завдання для студентів 2 курсу факультету інформатики
//		Національного університету “Києво-Могилянська академія”
//		Весняний триместр 2021-22 навчальний рік
//
//	5.  Визначити інтерфейс двосторонніх черг Deque.
//	6.	Визначити реалізацію двосторонньої черги на базі списку.
//	7.	Визначити реалізацію обмеженої двосторонньої черги на базі масиву.
//	8.	Визначити реалізацію необмеженої двосторонньої черги на базі масиву.
//	9.	Запропонувати і реалізувати пріоритетні черги : 
//		вилучається не перший в черзі елемент, а елемент з найвищим пріоритетом.
//
//	10*.Запропонувати і реалізувати варіанти черг з підгляданням, 
//		виділити їм місце в ієрархії черг.
// 
// project : Queues, developed by Ruslan Zymovets (SE-1)
//#############################################################################

namespace exam
{
	template<bool Condition, typename T, typename U>
	struct conditional
	{
		using _type = T;
	};

	template<typename T, typename U>
	struct conditional<false, T, U>
	{
		using _type = U;
	};

	template<bool Condition, typename T, typename U>
	using conditional_t = typename conditional<Condition, T, U>::_type;
}
#endif // !_CONDITIONAL_H_
