#ifndef _PEEK_BACK_
#define _PEEK_BACK_

//#############################################################################
//					“Об’єктно-орієнтоване програмування”					   
//												
//		Екзаменаційне завдання для студентів 2 курсу факультету інформатики
//		Національного університету “Києво-Могилянська академія”
//		Весняний триместр 2021-22 навчальний рік
//
//	5.  Визначити інтерфейс двосторонніх черг Deque.
//	6.	Визначити реалізацію двосторонньої черги на базі списку.
//	7.	Визначити реалізацію обмеженої двосторонньої черги на базі масиву.
//	8.	Визначити реалізацію необмеженої двосторонньої черги на базі масиву.
//	9.	Запропонувати і реалізувати пріоритетні черги : 
//		вилучається не перший в черзі елемент, а елемент з найвищим пріоритетом.
//
//	10*.Запропонувати і реалізувати варіанти черг з підгляданням, 
//		виділити їм місце в ієрархії черг.
// 
// project : Queues, developed by Ruslan Zymovets (SE-1)
//#############################################################################

namespace exam
{
	template<typename T>
	class PeekBack
	{
	public:
		PeekBack() = default;
		virtual ~PeekBack() = default;
		inline const T& peekback(const size_t) const;
	private:
		virtual inline const T& do_peekback(const size_t) const = 0;
	};

	template<typename T>
	inline const T& PeekBack<T>::peekback(const size_t i) const
	{
		return do_peekback(i);
	}
}
#endif // !_PEEK_BACK_